Tekla Open API Reference for Tekla Structures 2025
StringList.GetRange Method
 Gets a part of the string list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StringList GetRange(
	int index,
	int count
)
Public Function GetRange (
	index As Integer,
	count As Integer
) As StringList
Parameters
index
Type: System.Int32
The start index of the new list.
count
Type: System.Int32
The number of items in the new list.
Return Value
Type: StringList
The new string list.
See Also
Reference
StringList Class
Tekla.Structures.Drawing Namespace